public class Author {
    String name;
    String surname;
    int rating;
    public Author(String name, String surname, int rating ){
     this.name = name;
     this.surname = surname;
     this.rating = rating;
    }
}

//обавьте класс Author с полями name (имя), surname (фамилия) и rating (рейтинг, целое число),
// которые задаются конструктором.
//
//В класс книги теперь автор должен передаваться и храниться как объект класса Author.
// Метод matches должен проверять не
// только по имени автора, но и по фамилии.
// Цена книги теперь рассчитывается как 3 рубля за страницу, умноженное на квадратный корень из рейтинга,
// после чего округлённое вниз, но не меньше 250 рублей. Для вычисления квадратного корня воспользуйтесь
// командой Math.sqrt, округления вниз -
// Math.floor с приведением к целому числу - (int) Math.floor(...).